Repository: sha7cs/gproject
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Event deleted successfully.
ar: تم حذف الحدث بنجاح!

source: Event updated successfully.
ar: تم تعديل الحدث بنجاح!

source: Event added successfully!
ar: تم إضافة الحدث بنجاح!

source: Pending
ar: قيد الانتظار

source: Accepted
ar: مقبول

source: Denied
ar: مرفوض

source: Questions updated successfully!
ar: تم تعديل السؤال بنجاح!

source: New question created successfully!
ar: تم إنشاء السؤال بنجاح!

source: There was an error creating the question.
ar: كان هناك مشكلة في إنشاء السؤال

source: Question deleted successfully!
ar: تم حذف السؤال بنجاح!

source: New Subcategory created successfully!
ar: تم إنشاء تصنيف فرعي بنجاح!

source: There was an error creating the Subcategory.
ar: كان هناك مشكلة في إنشاء التصنيف فرعي

source: Subcategory deleted successfully!
ar: تم حذف التصنيف الفرعي بنجاح!

source: Not enough monthly data for prediction
ar: البيانات غير كافية لتوقع المبيعات

source: Insufficient data after merging
ar: البيانات غير كافية بعد الدمج.

source: Not enough data for training/testing split
ar: لا توجد بيانات كافية للتدريب والاختبار.

source: Your account is still pending
ar: حسابك لا زال قيد الانتظار

source: choose
ar: اختر

source: Enter your cafe name
ar: ادخل اسم مقهاك

source: Enter your cafe name in Arabic
ar: ادخل اسم مقهاك بالعربية

source: The file is not a valid CSV or contains unsupported encoding.
ar: الملف ليس بصيغة CSV صالحة أو يحتوي على ترميز غير مدعوم.

source: Missing required columns: %(cols)s
ar: الأعمدة المطلوبة مفقودة: %(cols)s

source: Event not found.
ar: لا يوجد حدث

source: Event added successfully.
ar: تم إضافة الحدث بنجاح!

source: Account created successfully! You are now logged in.
ar: تم إنشاء الحساب بنجاح! لقد تم تسجيل دخولك الآن.

source: Your account has been denied. Contact support.
ar: تم رفض حسابك. يرجى التواصل مع الدعم.

source: No profile associated with this account.
ar: لا يوجد ملف شخصي مرتبط بهذا الحساب.

source: You have already submitted your profile. You cannot access the settings page.
ar: لقد رفعت بياناتك سابقًا، الرجاء الانتظار حتى يصلك رد من جهتنا.

source: Your request has been submitted.
ar: لقد تم رفع طلبك.

source: Profile updated successfully!
ar: تم تعديل بياناتك بنجاح!

source: Event Name
ar: اسم الحدث

source: Description
ar: الوصف

source: Date
ar: التاريخ

source: Event
ar: الحدث

source: Events
ar: الأحداث

source: category
ar: التصنيف

source: description
ar: الوصف

source: Category
ar: التصنيف

source: Categories
ar: التصنيفات

source: subcategory
ar: التصنيف الفرعي

source: Subcategory
ar: التصنيف الفرعي

source: Subcategories
ar: التصنيفات الفرعية

source: question
ar: سؤال

source: Question
ar: سؤال

source: Questions
ar: أسئلة

source: title
ar: العنوان

source: advice
ar: النصيحة

source: Daily Advice
ar: النصيحة اليومية

source: Daily Advices
ar: النصائح اليومية

source: {}-{} of the month
ar: من يوم {} إلى {} من الشهر

source: {} of the month
ar: يوم {} من الشهر

source: No data available
ar: البيانات غير متوفرة

source: No advice available
ar: النصيحة غير متوفرة

source: dir
ar: rtl

source: languages
ar: اللغة

source: Settings
ar: الإعدادات

source: Logout
ar: تسجيل خروج

source: Users
ar: المستخدمين

source: Chatbot
ar: الشات بوت

source: chat control
ar: التحكم بالشات

source: What is displayed under it are all the subcategories associated with this category along with their questions, and you can manage them, including deleting and adding.
ar: ما يعرض تحتها هو كل التصنيفات الفرعية المرتبطة بهذا التصنيف مع اسئلتها، ويمكنك التحكم بها بما فيه الحذف والإضافة

source: Add a Subcategory
ar: أضف تصنيف فرعي

source: Delete the subcategory
ar: احذف التصنيف الفرعي

source: Add a new question
ar: إضافة سؤال جديد

source: Modify
ar: تعديل

source: Delete
ar: حذف

source: Modify Question:
ar: تعديل السؤال

source: The question in Arabic:
ar: السؤال بالعربية:

source: The question in English:
ar: السؤال بالإنجليزية:

source: Close
ar: إغلاق

source: Delete a Question:
ar: حذف سؤال

source: Are you sure?
ar: هل أنت متأكد؟

source: Add a Category:
ar: أضف تصنيف

source: The Subcategory in Arabic:
ar: التصنيف الفرعي بالعربية:

source: The Subcategory in English:
ar: التصنيف الفرعي بالإنجليزية:

source: Create
ar: إنشاء

source: No questions available
ar: لا يوجد اسئلة

source: Add Question:
ar: إضافة سؤال

source: Delete a Subcategory:
ar: حذف تصنيف فرعي

source: Event Control
ar: التحكم بالأحداث

source: Manage Events
ar: تحكم بالأحداث

source: Event Name (Arabic)
ar: عنوان الحدث (بالعربية)

source: Event Name (English)
ar: عنوان الحدث (بالإنجليزية)

source: Add Event
ar: إضافة حدث

source: Actions
ar: خيارات

source: Edit
ar: تعديل

source: No events yet.
ar: لا يوجد أحداث

source: Edit Event
ar: تعديل الحدث

source: Cancel
ar: إلغاء

source: Save Changes
ar: حفظ التغييرات

source: About the Cafe
ar: عن المقهى

source: Contact & Social Media
ar: وسائل التواصل الاجتماعي

source: Social Media:
ar: وسائل التواصل الاجتماعي

source: Firebase Configuration
ar: رابط الفايربيس

source: Firebase Config Link:
ar: رابط الفايربيس

source: Status
ar: الحالة

source: Additional Information
ar: معلومات إضافية

source: users settings
ar: إعدادات المستخدم

source: search for user...
ar: البحث عن مستخدم...

source: All
ar: الكل

source: Filters
ar: التصفية حسب

source: Filter by Date
ar: التصفية حسب التاريخ

source: Filter by Status
ar: التصفية حسب الحالة

source: Apply
ar: تطبيق

source: Reset
ar: إعادة تعيين

source: Logo
ar: الشعار

source: Registration Date
ar: تاريخ التسجيل

source: Full Name
ar: الاسم كامل

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Cafe Name
ar: اسم المقهى

source: Uploaded File
ar: ملف البيانات

source: Firebase Config
ar: رابط الفايربيس

source: Action
ar: خيارات

source: No Logo Uploaded
ar: لم يتم رفع الشعار

source: View File
ar: افتح الملف

source: No File
ar: لم يتم رفع ملف

source: Firebase Link
ar: رابط الفايربيس

source: No Firebase Config
ar: لا يوجد رابط فايربيس

source: More
ar: المزيد

source: Accept
ar: قبول

source: Remove
ar: رفض

source: Previous
ar: السابق

source: Next
ar: التالي

source: Sales Analysis
ar: تحليل المبيعات

source: Analysis Page
ar: صفحة التحليل

source: Generate Report
ar: إصدار تقرير

source: Select Date Range
ar: حدد الفترة الزمنية

source: Select Months
ar: اختر الشهر

source: From Date
ar: من تاريخ

source: To Date
ar: حتى تاريخ

source: Confirm
ar: تأكيد

source: Total Sales
ar: إجمالي المبيعات

source: Transactions
ar: المعاملات

source: Best Seller
ar: الأكثر مبيعًا

source: Sales Growth Rate
ar: معدل نمو المبيعات

source: Predicted Sales
ar: المبيعات المتوقعة

source: View sales breakdown by:
ar: عرض تفاصيل المبيعات حسب:

source: Month
ar: الأشهر

source: Day
ar: الأيام

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: Category Sales Distribution
ar: توزيع المبيعات حسب الفئة

source: Log In
ar: تسجيل الدخول

source: Welcome Back!
ar: مرحبًا بعودتك!

source: Don't have an account?
ar: لا يوجد لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Create an account
ar: إنشاء حساب

source: Join us to help elevate your cafe performace on trusted way!
ar: سجل معنا وخلنا نساعدك ترفع مستوى اداء مقهاك بطريقة موثوقه

source: Create Account
ar: إنشاء حساب

source: Already have an account?
ar: لديك حساب بالفعل؟

source: Log in
ar: تسجيل الدخول

source: <h1 class="page-title display-3" style= "color: rgb(143, 148, 116); font-weight: 700;">Welcome, %(username)s!</h1> <h1>Let’s break down your data and see what’s new..<br></h1> <h3 style="color:#B3B4B5;">Here are a few quick insights to help you plan things right</h3>
ar: <h1 class="page-title display-3" style="color: rgb(143, 148, 116); font-weight: 700;">حياك، %(username)s! </h1> <h1>خلنا نحلل بياناتك ونشوف وش الجديد..<br></h1> <h3 style="color:#B3B4B5;">قدامك لمحات سريعة تساعدك تخطط صح.</h3>

source: last month's category sales distribution:
ar: توزيع مبيعات الفئة لشهر الماضي:

source: see more on Analysis
ar: شاهد المزيد في صفحة التحليل

source: today's Advice:
ar: نصيحة اليوم:

source: learn more on promotions
ar: تعلم أكثر في صفحة العروض

source: next event is:
ar: الحدث القادم هو:

source: check for the date
ar: تحقق من التاريخ

source: Profile
ar: بيانات المستخدم

source: Notifications
ar: الإشعارات

source: No cafe description available.
ar: لا يوجد وصف للمقهى

source: Your cafe name in English
ar: اسم مقهاك بالإنجليزي

source: Your cafe name in Arabic
ar: اسم مقهاك بالعربي

source: Address
ar: الموقع

source: Data file
ar: ملف البيانات

source: View current file
ar: ملف بياناتك الحالية

source: View file structure requirements
ar: عرض متطلبات الملف

source: No firbase link available.
ar: لا يوجد رابط فايربيس

source: Area
ar: المنطقة

source: City
ar: المدينة

source: Update
ar: تحديث

source: Notifications tab (coming soon)
ar: علامة الإشعارات (قريبًا)

source: File Requirements
ar: متطلبات الملف

source: Required columns:
ar: الأعمدة المطلوبة

source: Optional columns:
ar: الأعمدة الاختيارية

source: Make sure the file is in .csv format and that column names match exactly or closely with the above.
ar: تأكد من أن الملف بصيغة .csv وأن أسماء الأعمدة تتطابق تمامًا أو بشكل قريب مع الأعمدة المذكورة أعلاه.

source: it's better to have the optional columns,but not required
ar: من الأفضل وجود الأعمدة الاختيارية، لكنها ليست ضرورية.

source: profile
ar: بيانات المستخدم

source: Cafe Name in English
ar: اسم الامقهى بالإنجليزية

source: Cafe Name in Arabic
ar: اسم المقهى بالعربي

source: Location
ar: الموقع الجغرافي

source: Upload you data here
ar: ارفع بياناتك هنا

source: Link to social media accounts if any
ar: رابط مواقع التواصل الاجتماعي إن وجد

source: Talk about you cafe briefly
ar: تحدث قليًا عن مقهاك

source: Cafe Logo
ar: شعار المقهى

source: By clicking the "Submit Your Request" button, you agree to upload your data to this website and confirm that the information is accurate.
ar: عند الضغط على زر "ارفع طلبك" فأنت توافق على رفع بياناتك إلى هذا الموقع، وتقر بأنها معلومات صحيحة.

source: Submit Your Request
ar: ارفع طلبك

source: By clicking "Confirm," you confirm your desire to submit your access request to the website. <br>We ask you to wait until you receive an email confirming your access approval.
ar: بضغطك على متأكد فأنت تؤكد رغبتك برفع طلب دخولك للموقع. <br> نطلب منك الانتظار حتى يصلك بريدك الكتروني ينص على قبولك أو رفضك.

source: Your Events
ar: أحداثك

source: Admin Event
ar: حدث من المطور

source: Are you sure you want to delete this event?
ar: هل أنت متأكد أنك تريد حذف هذا الحدث؟

source: Waiting for approval
ar: بانتظار القبول

source: Your request has been submitted ✅
ar: لقد تم رفع طلبك ✅

source: Please wait while your request is reviewed. You will be notified via email when your request is accepted or rejected.
ar: الرجاء الانتظار حتى يتم مراجعة طلبك، وسيتم إعلامك عن طريق البريد الإلكتروني عند قبول أو رفض طلبك.

source: Promotions Page
ar: صفحة الترويجات

source: Your Daily Marketing Advice
ar: نصيحتك اليومية

source: Best Days to Promote
ar: أفضل الأيام للعروض الترويجية

source: The best days for promotions based on sales trends.
ar: أفضل الأيام للعروض الترويجية بناءً على اتجاهات المبيعات.

source: Upcoming Event
ar: الحدث القادم

source: Days Remaining:
ar: الأيام المتبقية:

source: Date:
ar: التاريخ

source: No upcoming events.
ar: لا يوجد أحداث قادمة

source: Which Product to Discount
ar: أي منتج يجب تخفيض سعره

source: This product has the lowest sales and could benefit from a discount.
ar: هذا المنتج لديه أقل المبيعات وقد يستفيد من تخفيض السعر.

source: Welcome to the Chat
ar: أهلًا انا مساعدك التسويقي!

source: Click below to start
ar: انا شات تقدر تسأله عن أي شيء ممكن تحتاجه بالتسويق، والتحليل

source: start chat
ar: اضغط هنا لبدأ الدردشة

source: select category
ar: اختر التصنيف المرغوب

source: Select a Subcategory
ar: اختر الفئة التي تريد السؤال عنها

source: history btn style
ar: top: 10px; left: 10px

source: This button will refresh the chatbot's memory and start a new conversation.
ar: سيقوم هذا الزر بتحديث ذاكرة روبوت الدردشة وبدء محادثة جديدة.

source: You chose {category} to chat about {subcategory}. Please answer any given questions sincerely, so I can give you a good advice.
ar: اخترت {category} للدردشة حول {subcategory}. يرجى الإجابة على الأسئلة حتى أتمكن من إعطائك نصيحة جيدة.

source: botwelcome
ar: مرحبا، أنا مساعدك التسويقي اسألني اللي تبي!

source: typeanswer
ar: اكتب رسالتك هنا ...

source: send
ar: إرسال

source: Main pages
ar: الصفحات الرئيسية

source: Home
ar: الرئيسية

source: analysis
ar: التحليل

source: promotions
ar: التسويق

source: User
ar: المستخدم

source: language
ar: اللغة
